run/testInter2/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.steel.*"
    {
        nAlphaCorr      2;
        nAlphaSubCycles 1;

        MULESCorr       yes;
        nLimiterIter    5;
        alphaApplyPrevCorr no;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
        minIter         1;
    }

    
    p_rgh
    {
        solver          GAMG;
        smoother        DICGaussSeidel;
        tolerance       1e-08;
        relTol          0.01;
        cacheAgglomeration yes;
        maxIter         15;

        mergeLevels     1;
        agglomerator    faceAreaPair;
        nCellsInCoarsestLevel 10;
        directSolveCoarset false;
    }
    

    /*
    p_rgh 
    {
        solver          PCG;
        preconditioner
        {
            preconditioner  GAMG;
            tolerance       1e-07;
            relTol          0;
            nVcycles        2;
            smoother        GaussSeidel;
        }
        tolerance       1e-08;
        relTol          0.01;
        maxIter         20;
    }
    */    
    
    /*
    p_rgh 
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-08;
        relTol          0.01;
    }
    */

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }
    
    "pcorr.*"
    {
        $p_rghFinal;
        minIter         1;
    }
    
    "U.*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-7;
        relTol          0;
    }
    
    T
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.01;
    }

    TFinal
    {
        $T;
        relTol          0.0;
    }
}

PIMPLE
{
    momentumPredictor no;
    nCorrectors     4;
    nNonOrthogonalCorrectors 0;
    nOuterCorrectors 1;
}

/*
relaxationFactors
{
    equations
    {
        ".*" 1;
    }
}
*/

// ************************************************************************* //
